Tekla Open API Reference for Tekla Structures 2025
MaterialCatalog Constructor
Overload List
Name | Description
MaterialCatalog()
 Initiates a new instance of the control.
MaterialCatalog(String)
 Creates a new instance of the MaterialCatalog and will select the material (if available) in the tree.
Top
See Also
Reference
MaterialCatalog Class
Tekla.Structures.Dialog.UIControls Namespace